{
    "reactText": "I have about a years experince using React for personal use. I have built my best projects using React, because of its front end heavy focus, ease of use, and how organised it is. I have so far covered basic topics such as JSX, ternary operators (especially for conditonal JSX rendering and styling), states and effects, and have started learning refs and contexts.",
    "nextText" : "My React projects often incorporate Next.js as a framework, because of its popularity and server side rendering capabilities. I have been using Next since Next 14 was released, and I am currently still in the learning process. I have a general understanding of client and server components, routes, the layout page, and I often use Next because I like Vercels Geist font (which can't be used with any other framework, unfortunately)",
    "linuxText" : "Linux Mint has been my go-to OS for around 3 years. Although Mint has been my favourite due to it's simple learning curve, I have also tried out Manjaro and Void linux. However the lack of support for these distros has put me off from using them long term. I have a lot of experience with the i3-gaps window manager, and configuring it. I am also very familiar with Bash, since I use it on my main computer and have used it for a module in my first year.",
    "tailwindText" : "is one of my absolute favourite technologies to use in my web apps, because of how easy it is to learn and use. It also comes as a default package installed with many major React frameworks, which is helpful for me as I tend to use frameworks far more than I use vanilla Javascript. I have an understanding of adding custom configurations to tailwind.config, and I have memorised a good amount of the most popular utility classes (with my favourite CSS tool being flexbox). I am hoping to learn about the grid utility more in depth. ",
    "gitText" : "Git and Github are incredibly useful tools for me, and I have a basic understanding of its commands (staging, commiting, pushing, cloning, changing remote url), and am still in the process of learning pulls, pull requests, and branching + merging.",
    "javaText" : "I have used Java since the start of my degree, so for around a year consistently. I have an understanding of classes, interfaces, Javadoc, Intellij, enums, and most basic OOP concepts. I have also used Junit 5 tests before, however I haven't written any myself as of now.",
    "typescriptText" : "I picked up Typescript because of it's popularity in industry and convinient type checking at compile time. I am still new to typescript, and therefore still currently learning about types, interfaces, and generics"
}